# Task: Acquiring and Analyzing a Free Dataset from the Internet

In [1]:
import numpy as np 
import pandas as pd

## Loading the data from kaggle

In [2]:
dataset = pd.read_csv('jobs_in_data.csv')
dataset.head()

,work_year,job_title,job_category,salary_currency,salary,salary_in_usd,employee_residence,experience_level,employment_type,work_setting,company_location,company_size
0,2023,Data DevOps Engineer,Data Engineering,EUR,88000,95012,Germany,Mid-level,Full-time,Hybrid,Germany,L
1,2023,Data Architect,Data Architecture and Modeling,USD,186000,186000,United States,Senior,Full-time,In-person,United States,M
2,2023,Data Architect,Data Architecture and Modeling,USD,81800,81800,United States,Senior,Full-time,In-person,United States,M
3,2023,Data Scientist,Data Science and Research,USD,212000,212000,United States,Senior,Full-time,In-person,United States,M
4,2023,Data Scientist,Data Science and Research,USD,93300,93300,United States,Senior,Full-time,In-person,United States,M

In [3]:
dataset.describe()

         work_year         salary  salary_in_usd
count  9355.000000    9355.000000    9355.000000
mean   2022.760449  149927.981293  150299.495564
std       0.519470   63608.835387   63177.372024
min    2020.000000   14000.000000   15000.000000
25%    2023.000000  105200.000000  105700.000000
50%    2023.000000  143860.000000  143000.000000
75%    2023.000000  187000.000000  186723.000000
max    2023.000000  450000.000000  450000.000000

In [4]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9355 entries, 0 to 9354
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           9355 non-null   int64
 1   job_title           9355 non-null   object
 2   job_category        9355 non-null   object
 3   salary_currency     9355 non-null   object
 4   salary              9355 non-null   int64
 5   salary_in_usd       9355 non-null   int64
 6   employee_residence  9355 non-null   object
 7   experience_level    9355 non-null   object
 8   employment_type     9355 non-null   object
 9   work_setting        9355 non-null   object
 10  company_location    9355 non-null   object
 11  company_size        9355 non-null   object
dtypes: int64(3), object(9)
memory usage: 877.2+ KB

In [5]:
dataset.size

112260

In [6]:
dataset.shape

(9355, 12)

In [7]:
dataset.dtypes

work_year              int64
job_title             object
job_category          object
salary_currency       object
salary                 int64
salary_in_usd          int64
employee_residence    object
experience_level      object
employment_type       object
work_setting          object
company_location      object
company_size          object
dtype: object

In [8]:
dataset.isnull().sum()

work_year             0
job_title             0
job_category          0
salary_currency       0
salary                0
salary_in_usd         0
employee_residence    0
experience_level      0
employment_type       0
work_setting          0
company_location      0
company_size          0
dtype: int64

In [9]:
dataset['job_category'].unique()

array(['Data Engineering', 'Data Architecture and Modeling',
       'Data Science and Research', 'Machine Learning and AI',
       'Data Analysis', 'Leadership and Management',
       'BI and Visualization', 'Data Quality and Operations',
       'Data Management and Strategy', 'Cloud and Database'], dtype=object)

## Q5: For a numerical column of your choice, calculate the mean, median, and standard deviation.

In [10]:
dataset['salary'].mean()

149927.98129342598

In [11]:
dataset['salary'].median()

143860.0

In [12]:
dataset['salary'].std()

63608.83538733171

## Q6: Identify any potential outliers in a numerical column of your choice. Explain your approach.

In [13]:
Q1 = dataset['salary_in_usd'].quantile(0.25)
Q3 = dataset['salary_in_usd'].quantile(0.75)

In [14]:
Q1

105700.0

In [15]:
Q3

186723.0

In [16]:
IQR = Q3 - Q1

In [17]:
lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

In [18]:
lower_bound

-15834.5

In [19]:
upper_bound

308257.5

## Q7: Find the correlation between numerical columns and discuss any interesting relationships

In [23]:
dataset[['work_year', 'salary', 'salary_in_usd']].corr()

               work_year    salary  salary_in_usd
work_year       1.000000  0.160708       0.166003
salary          0.160708  1.000000       0.991309
salary_in_usd   0.166003  0.991309       1.000000

## Q8: Group the data by a categorical column and compute the aggregate statistics (e.g., mean, sum) for a numerical column.

In [24]:
dataset.groupby('job_title')['salary_in_usd'].agg(['mean', 'sum'])

                                          mean      sum
job_title
AI Architect                     250328.000000  3003936
AI Developer                     141140.888889  2540536
AI Engineer                      171663.972222  6179903
AI Programmer                     68817.400000   344087
AI Research Engineer              73271.500000   293086
...                                        ...      ...
Sales Data Analyst                60000.000000    60000
Software Data Engineer           111627.666667   334883
Staff Data Analyst                79917.000000   239751
Staff Data Scientist             134500.000000   269000
Staff Machine Learning Engineer  185000.000000   185000

[125 rows x 2 columns]

## Q9:: Based on your analysis, provide a brief summary of any insights or patterns you discovered in the dataset

### • Strong Correlation Between Salary and Salary in USD
### • Seniority and specialization in AI and machine learning tend to result in higher average salaries.
### • More common roles like AI Developer may have lower average salaries but are represented by a larger number of employees, leading to a higher total salary sum.